clc,clear
I=20:10:100;
subplot(2,2,1);
Tmax=[3764 2454 1724 1308 1044 862 730 620 538]';
plot(I,Tmax,'*')
hold on
p1=polyfit(I,Tmax,4);

I1=20:1:100;
Tmax1=p1(1)*I1.^4+p1(2)*I1.^3+p1(3)*I1.^2+p1(4)*I1+p1(5);
plot(I1,Tmax1,'r-')
legend('原始数据','拟合数据')

subplot(2,2,2);
I=20:10:100;
a=[0.0238 0.0315 0.0372 0.0489 0.0523 0.0481 0.0479 0.0490 0.0486]';
plot(I,a,'o')
hold on
p2=polyfit(I,a,7);
a1=p2(1)*I1.^7+p2(2)*I1.^6+p2(3)*I1.^5+p2(4)*I1.^4+p2(5)*I1.^3+p2(6)*I1.^2+p2(7)*I1+p2(8);
plot(I1,a1,'r-')
legend('原始数据','拟合数据')

subplot(2,2,3);
I=20:10:100;
b=[0.5136 0.5046 0.5040 0.4811 0.4839 0.5050 0.5146 0.5210 0.5300]';
plot(I,b,'x')
hold on
p3=polyfit(I,b,7);
b1=p3(1)*I1.^7+p3(2)*I1.^6+p3(3)*I1.^5+p3(4)*I1.^4+p3(5)*I1.^3+p3(6)*I1.^2+p3(7)*I1+p3(8);
plot(I1,b1,'r-')
legend('原始数据','拟合数据')

subplot(2,2,4);
T=1:1000;
U=a1(55)*(Tmax1(55)-T).^b1(55)+9;
plot(T,U,'-')
